MikroElektronika/core_packages/PIC/XC8/def/PIC16F1718/mcu.h
extern volatile DAC2REFbits_t DAC2REFbits __at(0x11B);
// bitfield macros
#define _DAC2REF_DACR_POSN                                  0x0
#define _DAC2REF_DACR_POSITION                              0x0
#define _DAC2REF_DACR_SIZE                                  0x5
#define _DAC2REF_DACR_LENGTH                                0x5
#define _DAC2REF_DACR_MASK                                  0x1F
#define _DAC2REF_DACR0_POSN                                 0x0
#define _DAC2REF_DACR0_POSITION                             0x0
#define _DAC2REF_DACR0_SIZE                                 0x1
#define _DAC2REF_DACR0_LENGTH                               0x1
#define _DAC2REF_DACR0_MASK                                 0x1
#define _DAC2REF_DACR1_POSN                                 0x1
#define _DAC2REF_DACR1_POSITION                             0x1
#define _DAC2REF_DACR1_SIZE                                 0x1
#define _DAC2REF_DACR1_LENGTH                               0x1
#define _DAC2REF_DACR1_MASK                                 0x2
#define _DAC2REF_DACR2_POSN                                 0x2
#define _DAC2REF_DACR2_POSITION                             0x2
#define _DAC2REF_DACR2_SIZE                                 0x1
#define _DAC2REF_DACR2_LENGTH                               0x1
#define _DAC2REF_DACR2_MASK                                 0x4
#define _DAC2REF_DACR3_POSN                                 0x3
#define _DAC2REF_DACR3_POSITION                             0x3
#define _DAC2REF_DACR3_SIZE                                 0x1
#define _DAC2REF_DACR3_LENGTH                               0x1
#define _DAC2REF_DACR3_MASK                                 0x8
#define _DAC2REF_DACR4_POSN                                 0x4
#define _DAC2REF_DACR4_POSITION                             0x4
#define _DAC2REF_DACR4_SIZE                                 0x1
#define _DAC2REF_DACR4_LENGTH                               0x1
#define _DAC2REF_DACR4_MASK                                 0x10
#define _DAC2REF_R0_POSN                                    0x0
#define _DAC2REF_R0_POSITION                                0x0
#define _DAC2REF_R0_SIZE                                    0x1
#define _DAC2REF_R0_LENGTH                                  0x1
#define _DAC2REF_R0_MASK                                    0x1
#define _DAC2REF_R1_POSN                                    0x1
#define _DAC2REF_R1_POSITION                                0x1
#define _DAC2REF_R1_SIZE                                    0x1
#define _DAC2REF_R1_LENGTH                                  0x1
#define _DAC2REF_R1_MASK                                    0x2
#define _DAC2REF_R2_POSN                                    0x2
#define _DAC2REF_R2_POSITION                                0x2
#define _DAC2REF_R2_SIZE                                    0x1
#define _DAC2REF_R2_LENGTH                                  0x1
#define _DAC2REF_R2_MASK                                    0x4
#define _DAC2REF_R3_POSN                                    0x3
#define _DAC2REF_R3_POSITION                                0x3
#define _DAC2REF_R3_SIZE                                    0x1
#define _DAC2REF_R3_LENGTH                                  0x1
#define _DAC2REF_R3_MASK                                    0x8
#define _DAC2REF_R4_POSN                                    0x4
#define _DAC2REF_R4_POSITION                                0x4
#define _DAC2REF_R4_SIZE                                    0x1
#define _DAC2REF_R4_LENGTH                                  0x1
#define _DAC2REF_R4_MASK                                    0x10
#define _DAC2REF_DAC2R_POSN                                 0x0
#define _DAC2REF_DAC2R_POSITION                             0x0
#define _DAC2REF_DAC2R_SIZE                                 0x5
#define _DAC2REF_DAC2R_LENGTH                               0x5
#define _DAC2REF_DAC2R_MASK                                 0x1F
#define _DAC2REF_DAC2R0_POSN                                0x0
#define _DAC2REF_DAC2R0_POSITION                            0x0
#define _DAC2REF_DAC2R0_SIZE                                0x1
#define _DAC2REF_DAC2R0_LENGTH                              0x1
#define _DAC2REF_DAC2R0_MASK                                0x1
#define _DAC2REF_DAC2R1_POSN                                0x1
#define _DAC2REF_DAC2R1_POSITION                            0x1
#define _DAC2REF_DAC2R1_SIZE                                0x1
#define _DAC2REF_DAC2R1_LENGTH                              0x1
#define _DAC2REF_DAC2R1_MASK                                0x2
#define _DAC2REF_DAC2R2_POSN                                0x2
#define _DAC2REF_DAC2R2_POSITION                            0x2
#define _DAC2REF_DAC2R2_SIZE                                0x1
#define _DAC2REF_DAC2R2_LENGTH                              0x1
#define _DAC2REF_DAC2R2_MASK                                0x4
#define _DAC2REF_DAC2R3_POSN                                0x3
#define _DAC2REF_DAC2R3_POSITION                            0x3
#define _DAC2REF_DAC2R3_SIZE                                0x1
#define _DAC2REF_DAC2R3_LENGTH                              0x1
#define _DAC2REF_DAC2R3_MASK                                0x8
#define _DAC2REF_DAC2R4_POSN                                0x4
#define _DAC2REF_DAC2R4_POSITION                            0x4
#define _DAC2REF_DAC2R4_SIZE                                0x1
#define _DAC2REF_DAC2R4_LENGTH                              0x1
#define _DAC2REF_DAC2R4_MASK                                0x10
#define _DAC2REF_REF0_POSN                                  0x0
#define _DAC2REF_REF0_POSITION                              0x0
#define _DAC2REF_REF0_SIZE                                  0x1
#define _DAC2REF_REF0_LENGTH                                0x1
#define _DAC2REF_REF0_MASK                                  0x1
#define _DAC2REF_REF1_POSN                                  0x1
#define _DAC2REF_REF1_POSITION                              0x1
#define _DAC2REF_REF1_SIZE                                  0x1
#define _DAC2REF_REF1_LENGTH                                0x1
#define _DAC2REF_REF1_MASK                                  0x2
#define _DAC2REF_REF2_POSN                                  0x2
#define _DAC2REF_REF2_POSITION                              0x2
#define _DAC2REF_REF2_SIZE                                  0x1
#define _DAC2REF_REF2_LENGTH                                0x1
#define _DAC2REF_REF2_MASK                                  0x4
#define _DAC2REF_REF3_POSN                                  0x3
#define _DAC2REF_REF3_POSITION                              0x3
#define _DAC2REF_REF3_SIZE                                  0x1
#define _DAC2REF_REF3_LENGTH                                0x1
#define _DAC2REF_REF3_MASK                                  0x8
#define _DAC2REF_REF4_POSN                                  0x4
#define _DAC2REF_REF4_POSITION                              0x4
#define _DAC2REF_REF4_SIZE                                  0x1
#define _DAC2REF_REF4_LENGTH                                0x1
#define _DAC2REF_REF4_MASK                                  0x10
#define _DAC2REF_REF5_POSN                                  0x5
#define _DAC2REF_REF5_POSITION                              0x5
#define _DAC2REF_REF5_SIZE                                  0x1
#define _DAC2REF_REF5_LENGTH                                0x1
#define _DAC2REF_REF5_MASK                                  0x20
#define _DAC2REF_DAC2REF0_POSN                              0x0
#define _DAC2REF_DAC2REF0_POSITION                          0x0
#define _DAC2REF_DAC2REF0_SIZE                              0x1
#define _DAC2REF_DAC2REF0_LENGTH                            0x1
#define _DAC2REF_DAC2REF0_MASK                              0x1
#define _DAC2REF_DAC2REF1_POSN                              0x1
#define _DAC2REF_DAC2REF1_POSITION                          0x1
#define _DAC2REF_DAC2REF1_SIZE                              0x1
#define _DAC2REF_DAC2REF1_LENGTH                            0x1
#define _DAC2REF_DAC2REF1_MASK                              0x2
#define _DAC2REF_DAC2REF2_POSN                              0x2
#define _DAC2REF_DAC2REF2_POSITION                          0x2
#define _DAC2REF_DAC2REF2_SIZE                              0x1
#define _DAC2REF_DAC2REF2_LENGTH                            0x1
#define _DAC2REF_DAC2REF2_MASK                              0x4
#define _DAC2REF_DAC2REF3_POSN                              0x3
#define _DAC2REF_DAC2REF3_POSITION                          0x3
#define _DAC2REF_DAC2REF3_SIZE                              0x1
#define _DAC2REF_DAC2REF3_LENGTH                            0x1
#define _DAC2REF_DAC2REF3_MASK                              0x8
#define _DAC2REF_DAC2REF4_POSN                              0x4
#define _DAC2REF_DAC2REF4_POSITION                          0x4
#define _DAC2REF_DAC2REF4_SIZE                              0x1
#define _DAC2REF_DAC2REF4_LENGTH                            0x1
#define _DAC2REF_DAC2REF4_MASK                              0x10
#define _DAC2REF_DAC2REF5_POSN                              0x5
#define _DAC2REF_DAC2REF5_POSITION                          0x5
#define _DAC2REF_DAC2REF5_SIZE                              0x1
#define _DAC2REF_DAC2REF5_LENGTH                            0x1
#define _DAC2REF_DAC2REF5_MASK                              0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC2R                  :5;
    };
    struct {
        unsigned DAC2R0                 :1;
        unsigned DAC2R1                 :1;
        unsigned DAC2R2                 :1;
        unsigned DAC2R3                 :1;
        unsigned DAC2R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
    };
    struct {
        unsigned DAC2REF0               :1;
        unsigned DAC2REF1               :1;
        unsigned DAC2REF2               :1;
        unsigned DAC2REF3               :1;
        unsigned DAC2REF4               :1;
        unsigned DAC2REF5               :1;
    };
} DAC2CON1bits_t;
extern volatile DAC2CON1bits_t DAC2CON1bits __at(0x11B);
// bitfield macros
#define _DAC2CON1_DACR_POSN                                 0x0
#define _DAC2CON1_DACR_POSITION                             0x0
#define _DAC2CON1_DACR_SIZE                                 0x5
#define _DAC2CON1_DACR_LENGTH                               0x5
#define _DAC2CON1_DACR_MASK                                 0x1F
#define _DAC2CON1_DACR0_POSN                                0x0
#define _DAC2CON1_DACR0_POSITION                            0x0
#define _DAC2CON1_DACR0_SIZE                                0x1
#define _DAC2CON1_DACR0_LENGTH                              0x1
#define _DAC2CON1_DACR0_MASK                                0x1
#define _DAC2CON1_DACR1_POSN                                0x1
#define _DAC2CON1_DACR1_POSITION                            0x1
#define _DAC2CON1_DACR1_SIZE                                0x1
#define _DAC2CON1_DACR1_LENGTH                              0x1
#define _DAC2CON1_DACR1_MASK                                0x2
#define _DAC2CON1_DACR2_POSN                                0x2
#define _DAC2CON1_DACR2_POSITION                            0x2
#define _DAC2CON1_DACR2_SIZE                                0x1
#define _DAC2CON1_DACR2_LENGTH                              0x1
#define _DAC2CON1_DACR2_MASK                                0x4
#define _DAC2CON1_DACR3_POSN                                0x3
#define _DAC2CON1_DACR3_POSITION                            0x3
#define _DAC2CON1_DACR3_SIZE                                0x1
#define _DAC2CON1_DACR3_LENGTH                              0x1
#define _DAC2CON1_DACR3_MASK                                0x8
#define _DAC2CON1_DACR4_POSN                                0x4
#define _DAC2CON1_DACR4_POSITION                            0x4
#define _DAC2CON1_DACR4_SIZE                                0x1
#define _DAC2CON1_DACR4_LENGTH                              0x1
#define _DAC2CON1_DACR4_MASK                                0x10
#define _DAC2CON1_R0_POSN                                   0x0
#define _DAC2CON1_R0_POSITION                               0x0
#define _DAC2CON1_R0_SIZE                                   0x1
#define _DAC2CON1_R0_LENGTH                                 0x1
#define _DAC2CON1_R0_MASK                                   0x1
#define _DAC2CON1_R1_POSN                                   0x1
#define _DAC2CON1_R1_POSITION                               0x1
#define _DAC2CON1_R1_SIZE                                   0x1
#define _DAC2CON1_R1_LENGTH                                 0x1
#define _DAC2CON1_R1_MASK                                   0x2
#define _DAC2CON1_R2_POSN                                   0x2
#define _DAC2CON1_R2_POSITION                               0x2
#define _DAC2CON1_R2_SIZE                                   0x1
#define _DAC2CON1_R2_LENGTH                                 0x1
#define _DAC2CON1_R2_MASK                                   0x4
#define _DAC2CON1_R3_POSN                                   0x3
#define _DAC2CON1_R3_POSITION                               0x3
#define _DAC2CON1_R3_SIZE                                   0x1
#define _DAC2CON1_R3_LENGTH                                 0x1
#define _DAC2CON1_R3_MASK                                   0x8
#define _DAC2CON1_R4_POSN                                   0x4
#define _DAC2CON1_R4_POSITION                               0x4
#define _DAC2CON1_R4_SIZE                                   0x1
#define _DAC2CON1_R4_LENGTH                                 0x1
#define _DAC2CON1_R4_MASK                                   0x10
#define _DAC2CON1_DAC2R_POSN                                0x0
#define _DAC2CON1_DAC2R_POSITION                            0x0
#define _DAC2CON1_DAC2R_SIZE                                0x5
#define _DAC2CON1_DAC2R_LENGTH                              0x5
#define _DAC2CON1_DAC2R_MASK                                0x1F
#define _DAC2CON1_DAC2R0_POSN                               0x0
#define _DAC2CON1_DAC2R0_POSITION                           0x0
#define _DAC2CON1_DAC2R0_SIZE                               0x1
#define _DAC2CON1_DAC2R0_LENGTH                             0x1
#define _DAC2CON1_DAC2R0_MASK                               0x1
#define _DAC2CON1_DAC2R1_POSN                               0x1
#define _DAC2CON1_DAC2R1_POSITION                           0x1
#define _DAC2CON1_DAC2R1_SIZE                               0x1
#define _DAC2CON1_DAC2R1_LENGTH                             0x1
#define _DAC2CON1_DAC2R1_MASK                               0x2
#define _DAC2CON1_DAC2R2_POSN                               0x2
#define _DAC2CON1_DAC2R2_POSITION                           0x2
#define _DAC2CON1_DAC2R2_SIZE                               0x1
#define _DAC2CON1_DAC2R2_LENGTH                             0x1
#define _DAC2CON1_DAC2R2_MASK                               0x4
#define _DAC2CON1_DAC2R3_POSN                               0x3
#define _DAC2CON1_DAC2R3_POSITION                           0x3
#define _DAC2CON1_DAC2R3_SIZE                               0x1
#define _DAC2CON1_DAC2R3_LENGTH                             0x1
#define _DAC2CON1_DAC2R3_MASK                               0x8
#define _DAC2CON1_DAC2R4_POSN                               0x4
#define _DAC2CON1_DAC2R4_POSITION                           0x4
#define _DAC2CON1_DAC2R4_SIZE                               0x1
#define _DAC2CON1_DAC2R4_LENGTH                             0x1
#define _DAC2CON1_DAC2R4_MASK                               0x10
#define _DAC2CON1_REF0_POSN                                 0x0
#define _DAC2CON1_REF0_POSITION                             0x0
#define _DAC2CON1_REF0_SIZE                                 0x1
#define _DAC2CON1_REF0_LENGTH                               0x1
#define _DAC2CON1_REF0_MASK                                 0x1
#define _DAC2CON1_REF1_POSN                                 0x1
#define _DAC2CON1_REF1_POSITION                             0x1
#define _DAC2CON1_REF1_SIZE                                 0x1
#define _DAC2CON1_REF1_LENGTH                               0x1
#define _DAC2CON1_REF1_MASK                                 0x2
#define _DAC2CON1_REF2_POSN                                 0x2
#define _DAC2CON1_REF2_POSITION                             0x2
#define _DAC2CON1_REF2_SIZE                                 0x1
#define _DAC2CON1_REF2_LENGTH                               0x1
#define _DAC2CON1_REF2_MASK                                 0x4
#define _DAC2CON1_REF3_POSN                                 0x3
#define _DAC2CON1_REF3_POSITION                             0x3
#define _DAC2CON1_REF3_SIZE                                 0x1
#define _DAC2CON1_REF3_LENGTH                               0x1
#define _DAC2CON1_REF3_MASK                                 0x8
#define _DAC2CON1_REF4_POSN                                 0x4
#define _DAC2CON1_REF4_POSITION                             0x4
#define _DAC2CON1_REF4_SIZE                                 0x1
#define _DAC2CON1_REF4_LENGTH                               0x1
#define _DAC2CON1_REF4_MASK                                 0x10
#define _DAC2CON1_REF5_POSN                                 0x5
#define _DAC2CON1_REF5_POSITION                             0x5
#define _DAC2CON1_REF5_SIZE                                 0x1
#define _DAC2CON1_REF5_LENGTH                               0x1
#define _DAC2CON1_REF5_MASK                                 0x20
#define _DAC2CON1_DAC2REF0_POSN                             0x0
#define _DAC2CON1_DAC2REF0_POSITION                         0x0
#define _DAC2CON1_DAC2REF0_SIZE                             0x1
#define _DAC2CON1_DAC2REF0_LENGTH                           0x1
#define _DAC2CON1_DAC2REF0_MASK                             0x1
#define _DAC2CON1_DAC2REF1_POSN                             0x1
#define _DAC2CON1_DAC2REF1_POSITION                         0x1
#define _DAC2CON1_DAC2REF1_SIZE                             0x1
#define _DAC2CON1_DAC2REF1_LENGTH                           0x1
#define _DAC2CON1_DAC2REF1_MASK                             0x2
#define _DAC2CON1_DAC2REF2_POSN                             0x2
#define _DAC2CON1_DAC2REF2_POSITION                         0x2
#define _DAC2CON1_DAC2REF2_SIZE                             0x1
#define _DAC2CON1_DAC2REF2_LENGTH                           0x1
#define _DAC2CON1_DAC2REF2_MASK                             0x4
#define _DAC2CON1_DAC2REF3_POSN                             0x3
#define _DAC2CON1_DAC2REF3_POSITION                         0x3
#define _DAC2CON1_DAC2REF3_SIZE                             0x1
#define _DAC2CON1_DAC2REF3_LENGTH                           0x1
#define _DAC2CON1_DAC2REF3_MASK                             0x8
#define _DAC2CON1_DAC2REF4_POSN                             0x4
#define _DAC2CON1_DAC2REF4_POSITION                         0x4
#define _DAC2CON1_DAC2REF4_SIZE                             0x1
#define _DAC2CON1_DAC2REF4_LENGTH                           0x1
#define _DAC2CON1_DAC2REF4_MASK                             0x10
#define _DAC2CON1_DAC2REF5_POSN                             0x5
#define _DAC2CON1_DAC2REF5_POSITION                         0x5
#define _DAC2CON1_DAC2REF5_SIZE                             0x1
#define _DAC2CON1_DAC2REF5_LENGTH                           0x1
#define _DAC2CON1_DAC2REF5_MASK                             0x20

