MikroElektronika/core_packages/PIC/XC8/def/PIC16F1718/mcu.h
// COG1FSIM<G1FSIM7>
extern volatile __bit                   G1FSIM7             __at(0x34E7);	// @ (0x69C * 8 + 7)
#define                                 G1FSIM7_bit         _BIT_ACCESS(COG1FSIM,7)
// COG1CON0<G1LD>
extern volatile __bit                   G1LD                __at(0x34BE);	// @ (0x697 * 8 + 6)
#define                                 G1LD_bit            _BIT_ACCESS(COG1CON0,6)
// COG1CON0<G1MD0>
extern volatile __bit                   G1MD0               __at(0x34B8);	// @ (0x697 * 8 + 0)
#define                                 G1MD0_bit           _BIT_ACCESS(COG1CON0,0)
// COG1CON0<G1MD1>
extern volatile __bit                   G1MD1               __at(0x34B9);	// @ (0x697 * 8 + 1)
#define                                 G1MD1_bit           _BIT_ACCESS(COG1CON0,1)
// COG1CON0<G1MD2>
extern volatile __bit                   G1MD2               __at(0x34BA);	// @ (0x697 * 8 + 2)
#define                                 G1MD2_bit           _BIT_ACCESS(COG1CON0,2)
// COG1PHF<G1PHF0>
extern volatile __bit                   G1PHF0              __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 G1PHF0_bit          _BIT_ACCESS(COG1PHF,0)
// COG1PHF<G1PHF1>
extern volatile __bit                   G1PHF1              __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 G1PHF1_bit          _BIT_ACCESS(COG1PHF,1)
// COG1PHF<G1PHF2>
extern volatile __bit                   G1PHF2              __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 G1PHF2_bit          _BIT_ACCESS(COG1PHF,2)
// COG1PHF<G1PHF3>
extern volatile __bit                   G1PHF3              __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 G1PHF3_bit          _BIT_ACCESS(COG1PHF,3)
// COG1PHF<G1PHF4>
extern volatile __bit                   G1PHF4              __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 G1PHF4_bit          _BIT_ACCESS(COG1PHF,4)
// COG1PHF<G1PHF5>
extern volatile __bit                   G1PHF5              __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 G1PHF5_bit          _BIT_ACCESS(COG1PHF,5)
// COG1PHR<G1PHR0>
extern volatile __bit                   G1PHR0              __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 G1PHR0_bit          _BIT_ACCESS(COG1PHR,0)
// COG1PHR<G1PHR1>
extern volatile __bit                   G1PHR1              __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 G1PHR1_bit          _BIT_ACCESS(COG1PHR,1)
// COG1PHR<G1PHR2>
extern volatile __bit                   G1PHR2              __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 G1PHR2_bit          _BIT_ACCESS(COG1PHR,2)
// COG1PHR<G1PHR3>
extern volatile __bit                   G1PHR3              __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 G1PHR3_bit          _BIT_ACCESS(COG1PHR,3)
// COG1PHR<G1PHR4>
extern volatile __bit                   G1PHR4              __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 G1PHR4_bit          _BIT_ACCESS(COG1PHR,4)
// COG1PHR<G1PHR5>
extern volatile __bit                   G1PHR5              __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 G1PHR5_bit          _BIT_ACCESS(COG1PHR,5)
// COG1CON1<G1POLA>
extern volatile __bit                   G1POLA              __at(0x34C0);	// @ (0x698 * 8 + 0)
#define                                 G1POLA_bit          _BIT_ACCESS(COG1CON1,0)
// COG1CON1<G1POLB>
extern volatile __bit                   G1POLB              __at(0x34C1);	// @ (0x698 * 8 + 1)
#define                                 G1POLB_bit          _BIT_ACCESS(COG1CON1,1)
// COG1CON1<G1POLC>
extern volatile __bit                   G1POLC              __at(0x34C2);	// @ (0x698 * 8 + 2)
#define                                 G1POLC_bit          _BIT_ACCESS(COG1CON1,2)
// COG1CON1<G1POLD>
extern volatile __bit                   G1POLD              __at(0x34C3);	// @ (0x698 * 8 + 3)
#define                                 G1POLD_bit          _BIT_ACCESS(COG1CON1,3)
// COG1CON1<G1RDBS>
extern volatile __bit                   G1RDBS              __at(0x34C7);	// @ (0x698 * 8 + 7)
#define                                 G1RDBS_bit          _BIT_ACCESS(COG1CON1,7)
// COG1RIS<G1RIS0>
extern volatile __bit                   G1RIS0              __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 G1RIS0_bit          _BIT_ACCESS(COG1RIS,0)
// COG1RIS<G1RIS1>
extern volatile __bit                   G1RIS1              __at(0x34C9);	// @ (0x699 * 8 + 1)
#define                                 G1RIS1_bit          _BIT_ACCESS(COG1RIS,1)
// COG1RIS<G1RIS2>
extern volatile __bit                   G1RIS2              __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 G1RIS2_bit          _BIT_ACCESS(COG1RIS,2)
// COG1RIS<G1RIS3>
extern volatile __bit                   G1RIS3              __at(0x34CB);	// @ (0x699 * 8 + 3)
#define                                 G1RIS3_bit          _BIT_ACCESS(COG1RIS,3)
// COG1RIS<G1RIS4>
extern volatile __bit                   G1RIS4              __at(0x34CC);	// @ (0x699 * 8 + 4)
#define                                 G1RIS4_bit          _BIT_ACCESS(COG1RIS,4)
// COG1RIS<G1RIS5>
extern volatile __bit                   G1RIS5              __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 G1RIS5_bit          _BIT_ACCESS(COG1RIS,5)
// COG1RIS<G1RIS6>
extern volatile __bit                   G1RIS6              __at(0x34CE);	// @ (0x699 * 8 + 6)
#define                                 G1RIS6_bit          _BIT_ACCESS(COG1RIS,6)
// COG1RIS<G1RIS7>
extern volatile __bit                   G1RIS7              __at(0x34CF);	// @ (0x699 * 8 + 7)
#define                                 G1RIS7_bit          _BIT_ACCESS(COG1RIS,7)
// COG1RSIM<G1RSIM0>
extern volatile __bit                   G1RSIM0             __at(0x34D0);	// @ (0x69A * 8 + 0)
#define                                 G1RSIM0_bit         _BIT_ACCESS(COG1RSIM,0)
// COG1RSIM<G1RSIM1>
extern volatile __bit                   G1RSIM1             __at(0x34D1);	// @ (0x69A * 8 + 1)
#define                                 G1RSIM1_bit         _BIT_ACCESS(COG1RSIM,1)
// COG1RSIM<G1RSIM2>
extern volatile __bit                   G1RSIM2             __at(0x34D2);	// @ (0x69A * 8 + 2)
#define                                 G1RSIM2_bit         _BIT_ACCESS(COG1RSIM,2)
// COG1RSIM<G1RSIM3>
extern volatile __bit                   G1RSIM3             __at(0x34D3);	// @ (0x69A * 8 + 3)
#define                                 G1RSIM3_bit         _BIT_ACCESS(COG1RSIM,3)
// COG1RSIM<G1RSIM4>
extern volatile __bit                   G1RSIM4             __at(0x34D4);	// @ (0x69A * 8 + 4)
#define                                 G1RSIM4_bit         _BIT_ACCESS(COG1RSIM,4)
// COG1RSIM<G1RSIM5>
extern volatile __bit                   G1RSIM5             __at(0x34D5);	// @ (0x69A * 8 + 5)
#define                                 G1RSIM5_bit         _BIT_ACCESS(COG1RSIM,5)
// COG1RSIM<G1RSIM6>
extern volatile __bit                   G1RSIM6             __at(0x34D6);	// @ (0x69A * 8 + 6)
#define                                 G1RSIM6_bit         _BIT_ACCESS(COG1RSIM,6)
// COG1RSIM<G1RSIM7>
extern volatile __bit                   G1RSIM7             __at(0x34D7);	// @ (0x69A * 8 + 7)
#define                                 G1RSIM7_bit         _BIT_ACCESS(COG1RSIM,7)
// COG1STR<G1SDATA>
extern volatile __bit                   G1SDATA             __at(0x34FC);	// @ (0x69F * 8 + 4)
#define                                 G1SDATA_bit         _BIT_ACCESS(COG1STR,4)
// COG1STR<G1SDATB>
extern volatile __bit                   G1SDATB             __at(0x34FD);	// @ (0x69F * 8 + 5)
#define                                 G1SDATB_bit         _BIT_ACCESS(COG1STR,5)
// COG1STR<G1SDATC>
extern volatile __bit                   G1SDATC             __at(0x34FE);	// @ (0x69F * 8 + 6)
#define                                 G1SDATC_bit         _BIT_ACCESS(COG1STR,6)
// COG1STR<G1SDATD>
extern volatile __bit                   G1SDATD             __at(0x34FF);	// @ (0x69F * 8 + 7)
#define                                 G1SDATD_bit         _BIT_ACCESS(COG1STR,7)
// COG1STR<G1STRA>
extern volatile __bit                   G1STRA              __at(0x34F8);	// @ (0x69F * 8 + 0)
#define                                 G1STRA_bit          _BIT_ACCESS(COG1STR,0)
// COG1STR<G1STRB>
extern volatile __bit                   G1STRB              __at(0x34F9);	// @ (0x69F * 8 + 1)
#define                                 G1STRB_bit          _BIT_ACCESS(COG1STR,1)
// COG1STR<G1STRC>
extern volatile __bit                   G1STRC              __at(0x34FA);	// @ (0x69F * 8 + 2)
#define                                 G1STRC_bit          _BIT_ACCESS(COG1STR,2)
// COG1STR<G1STRD>
extern volatile __bit                   G1STRD              __at(0x34FB);	// @ (0x69F * 8 + 3)
#define                                 G1STRD_bit          _BIT_ACCESS(COG1STR,3)
// SSP1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0x10B7);	// @ (0x216 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// OSCSTAT<HFIOFL>
extern volatile __bit                   HFIOFL              __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 HFIOFL_bit          _BIT_ACCESS(OSCSTAT,3)
// OSCSTAT<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCSTAT,4)
// OSCSTAT<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCSTAT,0)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x1C60);	// @ (0x38C * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x1C61);	// @ (0x38C * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x1C62);	// @ (0x38C * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x1C63);	// @ (0x38C * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x1C64);	// @ (0x38C * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x1C65);	// @ (0x38C * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLA<INLVLA6>
extern volatile __bit                   INLVLA6             __at(0x1C66);	// @ (0x38C * 8 + 6)
#define                                 INLVLA6_bit         _BIT_ACCESS(INLVLA,6)
// INLVLA<INLVLA7>
extern volatile __bit                   INLVLA7             __at(0x1C67);	// @ (0x38C * 8 + 7)
#define                                 INLVLA7_bit         _BIT_ACCESS(INLVLA,7)
// INLVLB<INLVLB0>
extern volatile __bit                   INLVLB0             __at(0x1C68);	// @ (0x38D * 8 + 0)
#define                                 INLVLB0_bit         _BIT_ACCESS(INLVLB,0)
// INLVLB<INLVLB1>
extern volatile __bit                   INLVLB1             __at(0x1C69);	// @ (0x38D * 8 + 1)
#define                                 INLVLB1_bit         _BIT_ACCESS(INLVLB,1)
// INLVLB<INLVLB2>
extern volatile __bit                   INLVLB2             __at(0x1C6A);	// @ (0x38D * 8 + 2)
#define                                 INLVLB2_bit         _BIT_ACCESS(INLVLB,2)
// INLVLB<INLVLB3>
extern volatile __bit                   INLVLB3             __at(0x1C6B);	// @ (0x38D * 8 + 3)
#define                                 INLVLB3_bit         _BIT_ACCESS(INLVLB,3)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x1C6C);	// @ (0x38D * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x1C6D);	// @ (0x38D * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x1C6E);	// @ (0x38D * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x1C6F);	// @ (0x38D * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x1C70);	// @ (0x38E * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x1C71);	// @ (0x38E * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x1C72);	// @ (0x38E * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x1C73);	// @ (0x38E * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x1C74);	// @ (0x38E * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x1C75);	// @ (0x38E * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x1C76);	// @ (0x38E * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x1C77);	// @ (0x38E * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0x1C83);	// @ (0x390 * 8 + 3)
#define                                 INLVLE3_bit         _BIT_ACCESS(INLVLE,3)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x1C98);	// @ (0x393 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x1C99);	// @ (0x393 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x1C9A);	// @ (0x393 * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0x1C9B);	// @ (0x393 * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAF<IOCAF4>
extern volatile __bit                   IOCAF4              __at(0x1C9C);	// @ (0x393 * 8 + 4)
#define                                 IOCAF4_bit          _BIT_ACCESS(IOCAF,4)
// IOCAF<IOCAF5>
extern volatile __bit                   IOCAF5              __at(0x1C9D);	// @ (0x393 * 8 + 5)
#define                                 IOCAF5_bit          _BIT_ACCESS(IOCAF,5)
// IOCAF<IOCAF6>
extern volatile __bit                   IOCAF6              __at(0x1C9E);	// @ (0x393 * 8 + 6)
#define                                 IOCAF6_bit          _BIT_ACCESS(IOCAF,6)
// IOCAF<IOCAF7>
extern volatile __bit                   IOCAF7              __at(0x1C9F);	// @ (0x393 * 8 + 7)
#define                                 IOCAF7_bit          _BIT_ACCESS(IOCAF,7)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0x1C90);	// @ (0x392 * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0x1C91);	// @ (0x392 * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0x1C92);	// @ (0x392 * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0x1C93);	// @ (0x392 * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAN<IOCAN4>
extern volatile __bit                   IOCAN4              __at(0x1C94);	// @ (0x392 * 8 + 4)
#define                                 IOCAN4_bit          _BIT_ACCESS(IOCAN,4)
// IOCAN<IOCAN5>
extern volatile __bit                   IOCAN5              __at(0x1C95);	// @ (0x392 * 8 + 5)
#define                                 IOCAN5_bit          _BIT_ACCESS(IOCAN,5)
// IOCAN<IOCAN6>
extern volatile __bit                   IOCAN6              __at(0x1C96);	// @ (0x392 * 8 + 6)
#define                                 IOCAN6_bit          _BIT_ACCESS(IOCAN,6)
// IOCAN<IOCAN7>
extern volatile __bit                   IOCAN7              __at(0x1C97);	// @ (0x392 * 8 + 7)
#define                                 IOCAN7_bit          _BIT_ACCESS(IOCAN,7)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0x1C88);	// @ (0x391 * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0x1C89);	// @ (0x391 * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0x1C8A);	// @ (0x391 * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0x1C8B);	// @ (0x391 * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// IOCAP<IOCAP4>
extern volatile __bit                   IOCAP4              __at(0x1C8C);	// @ (0x391 * 8 + 4)
#define                                 IOCAP4_bit          _BIT_ACCESS(IOCAP,4)
// IOCAP<IOCAP5>
extern volatile __bit                   IOCAP5              __at(0x1C8D);	// @ (0x391 * 8 + 5)
#define                                 IOCAP5_bit          _BIT_ACCESS(IOCAP,5)
// IOCAP<IOCAP6>
extern volatile __bit                   IOCAP6              __at(0x1C8E);	// @ (0x391 * 8 + 6)
#define                                 IOCAP6_bit          _BIT_ACCESS(IOCAP,6)
// IOCAP<IOCAP7>
extern volatile __bit                   IOCAP7              __at(0x1C8F);	// @ (0x391 * 8 + 7)
#define                                 IOCAP7_bit          _BIT_ACCESS(IOCAP,7)
// IOCBF<IOCBF0>
extern volatile __bit                   IOCBF0              __at(0x1CB0);	// @ (0x396 * 8 + 0)
#define                                 IOCBF0_bit          _BIT_ACCESS(IOCBF,0)
// IOCBF<IOCBF1>
extern volatile __bit                   IOCBF1              __at(0x1CB1);	// @ (0x396 * 8 + 1)
#define                                 IOCBF1_bit          _BIT_ACCESS(IOCBF,1)
// IOCBF<IOCBF2>
extern volatile __bit                   IOCBF2              __at(0x1CB2);	// @ (0x396 * 8 + 2)
#define                                 IOCBF2_bit          _BIT_ACCESS(IOCBF,2)
// IOCBF<IOCBF3>
extern volatile __bit                   IOCBF3              __at(0x1CB3);	// @ (0x396 * 8 + 3)
#define                                 IOCBF3_bit          _BIT_ACCESS(IOCBF,3)
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0x1CB4);	// @ (0x396 * 8 + 4)
#define                                 IOCBF4_bit          _BIT_ACCESS(IOCBF,4)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x1CB5);	// @ (0x396 * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x1CB6);	// @ (0x396 * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x1CB7);	// @ (0x396 * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN0>
extern volatile __bit                   IOCBN0              __at(0x1CA8);	// @ (0x395 * 8 + 0)
#define                                 IOCBN0_bit          _BIT_ACCESS(IOCBN,0)
// IOCBN<IOCBN1>
extern volatile __bit                   IOCBN1              __at(0x1CA9);	// @ (0x395 * 8 + 1)
#define                                 IOCBN1_bit          _BIT_ACCESS(IOCBN,1)
// IOCBN<IOCBN2>
extern volatile __bit                   IOCBN2              __at(0x1CAA);	// @ (0x395 * 8 + 2)
#define                                 IOCBN2_bit          _BIT_ACCESS(IOCBN,2)
// IOCBN<IOCBN3>
extern volatile __bit                   IOCBN3              __at(0x1CAB);	// @ (0x395 * 8 + 3)
#define                                 IOCBN3_bit          _BIT_ACCESS(IOCBN,3)
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0x1CAC);	// @ (0x395 * 8 + 4)
#define                                 IOCBN4_bit          _BIT_ACCESS(IOCBN,4)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x1CAD);	// @ (0x395 * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x1CAE);	// @ (0x395 * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0x1CAF);	// @ (0x395 * 8 + 7)
#define                                 IOCBN7_bit          _BIT_ACCESS(IOCBN,7)
// IOCBP<IOCBP0>
extern volatile __bit                   IOCBP0              __at(0x1CA0);	// @ (0x394 * 8 + 0)
#define                                 IOCBP0_bit          _BIT_ACCESS(IOCBP,0)
// IOCBP<IOCBP1>
extern volatile __bit                   IOCBP1              __at(0x1CA1);	// @ (0x394 * 8 + 1)
